src/InformationRegisters/ТоварыДругогоКачества/ТоварыДругогоКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТоварыДругогоКачества</name>
  <resources>
    <name>ГрадацияКачества</name>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураБрак</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ГрадацииКачества/ГрадацииКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГрадацииКачества</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ОграниченноГоден</name>
  </enumValues>
  <enumValues>
    <name>НеГоден</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОформленияПродажи</name>
    <type>
      <types>EnumRef.ВариантыОформленияПродажи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесМожноУказыватьВДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетСертификатовНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.УДАЛИТЬЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьТоварыДругогоКачества</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаМожноУказыватьВДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьИндивидуальныйШаблонЦенника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьИндивидуальныйШаблонЭтикетки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбъем</name>
    <comment>Только для обновления ИБ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлОписанияДляСайта</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемМожноУказыватьВДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаОбеспечения</name>
    <type>
      <types>CatalogRef.СхемыОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбеспеченияПотребностей</name>
    <type>
      <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьМожноУказыватьВДокументах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.УДАЛИТЬЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентЕдиницыДляОтчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>СезоннаяГруппа</name>
    <type>
      <types>CatalogRef.СезонныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоллекцияНоменклатуры</name>
    <type>
      <types>CatalogRef.КоллекцииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛьготаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмеряетсяТолькоВСуммовомВыражении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДляПечатиВКолонкеЦенаНалоговойНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РейтингПродаж</name>
    <type>
      <types>CatalogRef.РейтингиПродажНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленнаяЗакупкаПродажа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураГТД</name>
    <type>
      <types>CatalogRef.НоменклатураГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецСерий</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецХарактеристик</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецТоварныхКатегорий</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДекларацииПоАкцизномуНалогу</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЛьготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьШтрихкодАкцизнойМаркиПриПечатиЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ТоварыДругогоКачества/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПроверитьНаличиеГрадации(Номенклатура, НекачественныйТовар) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыДругогоКачества.НоменклатураБрак КАК НекачественныйТовар
	|ИЗ
	|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
	|ГДЕ
	|	ТоварыДругогоКачества.Номенклатура = &Номенклатура
	|			И ТоварыДругогоКачества.НоменклатураБрак = &НоменклатураБрак
	|			И ТоварыДругогоКачества.ГрадацияКачества = &ГрадацияКачества";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НоменклатураБрак", НекачественныйТовар);
	Запрос.УстановитьПараметр("ГрадацияКачества", НекачественныйТовар.Качество);
	Результат = Запрос.Выполнить();
	ЕстьСоответствие = Не Результат.Пустой();
	Возврат ЕстьСоответствие;
КонецФункции

Процедура ЗаписатьСвязьСТоваромДругогоКачества(КачественныйТовар, НекачественныйТовар) Экспорт
	
	ТекстСообщения = "";
	Если НекачественныйТовар.Качество = Перечисления.ГрадацииКачества.Новый Тогда
		ТекстСообщения = НСтр("ru='Невозможно установить соответствие. Некачественный товар не может иметь качество ""Новый""';uk='Неможливо встановити відповідність. Неякісний товар не може мати якість ""Новий""'");
	ИначеЕсли  НекачественныйТовар.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
		ТекстСообщения = НСтр("ru='Невозможно установить соответствие. Некачественный товар не может иметь тип номенклатуры ""Услуга""';uk='Неможливо встановити відповідність. Неякісний товар не може мати тип номенклатури ""Послуга""'");
	ИначеЕсли  НекачественныйТовар.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
		ТекстСообщения = НСтр("ru='Невозможно установить соответствие. Некачественный товар не может иметь тип номенклатуры ""Работа""';uk='Неможливо встановити відповідність. Неякісний товар не може мати тип номенклатури ""Робота""'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат
	КонецЕсли;
		
	Если КачественныйТовар.Качество <> Перечисления.ГрадацииКачества.Новый Тогда
		ЗапросПоСоответствиюНоменклатуры = Новый Запрос;
		ЗапросПоСоответствиюНоменклатуры.УстановитьПараметр("НоменклатураБрак", КачественныйТовар);
		ЗапросПоСоответствиюНоменклатуры.Текст = 
		"ВЫБРАТЬ
		|	ТоварыДругогоКачества.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
		|ГДЕ
		|	ТоварыДругогоКачества.НоменклатураБрак = &НоменклатураБрак";
		Результат = ЗапросПоСоответствиюНоменклатуры.Выполнить();
		Если Результат.Пустой() Тогда
			ШаблонТекстаСообщенияОбОшибке = НСтр("ru='Невозможно найти качественный товар соответствующий товару %НекачественныйТовар%';uk='Неможливо знайти якісний товар, який відповідає товару %НекачественныйТовар%'");
			ТекстСообщения = СтрЗаменить(ШаблонТекстаСообщенияОбОшибке, "%НекачественныйТовар%", НекачественныйТовар.Наименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			КачественныйТовар = Выборка.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьРегистраСведений = РегистрыСведений.ТоварыДругогоКачества.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСведений.Номенклатура 	= КачественныйТовар;
	ЗаписьРегистраСведений.НоменклатураБрак = НекачественныйТовар;
	ЗаписьРегистраСведений.ГрадацияКачества = НекачественныйТовар.Качество;
	ЗаписьРегистраСведений.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпрНоменклатура.ЕстьТоварыДругогоКачества КАК ЕстьТоварыДругогоКачестваВБазе,
	|	ВЫБОР
	|		КОГДА ТоварыДругогоКачества.НоменклатураБрак ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьТоварыДругогоКачестваПоФакту
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
	|		ПО СпрНоменклатура.Ссылка = ТоварыДругогоКачества.Номенклатура
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура
	|	И СпрНоменклатура.ЕстьТоварыДругогоКачества <> ВЫБОР
	|			КОГДА ТоварыДругогоКачества.НоменклатураБрак ЕСТЬ NULL 
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Номенклатура",КачественныйТовар);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект = КачественныйТовар.ПолучитьОбъект();
		Объект.ЕстьТоварыДругогоКачества = Выборка.ЕстьТоварыДругогоКачестваПоФакту;		
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТоварИсходногоКачества(Товар) Экспорт
	Если Товар.Качество <> Перечисления.ГрадацииКачества.Новый Тогда
		КачественныйТовар = Неопределено;
		ЗапросПоКачественномуТовару = Новый Запрос;
		ЗапросПоКачественномуТовару.УстановитьПараметр("Номенклатура", Товар);
		ЗапросПоКачественномуТовару.Текст =
		"ВЫБРАТЬ
		|	ТоварыДругогоКачества.Номенклатура КАК КачественныйТовар
		|ИЗ
		|	РегистрСведений.ТоварыДругогоКачества КАК ТоварыДругогоКачества
		|ГДЕ
		|	ТоварыДругогоКачества.Номенклатура.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый)
		|	И ТоварыДругогоКачества.НоменклатураБрак = &Номенклатура";
		Выборка = ЗапросПоКачественномуТовару.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			КачественныйТовар = Выборка.КачественныйТовар;
		КонецЦикла;
		Возврат КачественныйТовар;
	Иначе 
		Возврат Товар;
	КонецЕсли;
КонецФункции


#КонецЕсли
